[
    {
        "ability_score_increase": {
            "abilities": {
                "charisma": 0,
                "constitution": 2,
                "dexterity": 0,
                "intellect": 0,
                "strength": 0,
                "wisdom": 0
            },
            "description": ""
        },
        "age": {
            "adulthood": 50,
            "description": "Dwarves mature at the same rate as humans, but they're considered young until they reach the age of 50.  On average, they live about 350 years.",
            "lifespan": 350
        },
        "alignment": {
            "alignment": "LG",
            "description": "Most dwarves are lawful, believing firmly in the benefits of a well-ordered society. They tend toward good as well, with a strong sense of fair play and a belief that everyone deserves to share in the benefits of a just order"
        },
        "description": "Bold and hardy, dwarves are known as skilled warriors, miners, and workers of stone and metal. Though they stand well under 5 feet tall, dwarves are so broad and compact that they can weigh as much as a human standing nearly two feet taller. Their courage and endurance are also easily a match for any of the larger folk.  Dwarven skin ranges from deep brown to a paler hue tinged with red, but the most com m on shades are light brown or deep tan, like certain tones of earth.  Their hair, worn long but in simple styles, is usually black, gray, or brown, though paler dwarves often have red hair. Male dwarves value their beards highly and groom them carefully.",
        "languages": [
            "Common",
            "Dwarvish"
        ],
        "modifiers": [
            {
                "description": "Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.",
                "modifier": "Darkvision"
            },
            {
                "description": "You have advantage on saving throws against poison, and you have resistance against poison damage (explained in chapter 9).",
                "modifier": "Dwarven Resilience"
            },
            {
                "description": "You have proficiency with the battleaxe, handaxe, throwing hammer, and warhammer.",
                "modifier": "Dwarven Combat Training"
            },
            {
                "description": "You gain proficiency with the artisan's tools of your choice: smith's tools, brewer's supplies, or mason's tools.",
                "modifier": "Tool Proficiency"
            },
            {
                "description": "Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus.",
                "modifier": "Stonecunning"
            }
        ],
        "names": {
            "child": [],
            "clan": [
                "Balderk",
                "Battlehammer",
                "Brawnanvil",
                "Dankil",
                "Fireforge",
                "Frostbeard",
                "Gorunn",
                "Holderhek",
                "Ironfist",
                "Loderr",
                "Lutgehr",
                "Rumnaheim",
                "Strakeln",
                "Torunn",
                "Ungart"
            ],
            "description": "A dwarf's name is granted by a clan elder, in accordance with tradition. Every proper dwarven name has been used and reused down through the generations. A dwarf's name belongs to the clan, not to the individual.  A dwarf who misuses or brings shame to a clan name is stripped of the name and forbidden by law to use any dwarven name in its place.",
            "family": [],
            "female": [
                "Amber",
                "Artin",
                "Audhild",
                "Bardryn",
                "Dagnal",
                "Diesa",
                "Eldeth",
                "Falkrunn",
                "Finellen",
                "Gunnloda",
                "Gurdis",
                "Helja",
                "Hlin",
                "Kathra",
                "Kristryd",
                "Ilde",
                "Liftrasa",
                "Mardred",
                "Riswynn",
                "Sannl",
                "Torbera",
                "Torgga",
                "Vistra"
            ],
            "male": [
                "Adrik",
                "Alberich",
                "Baern",
                "Barendd",
                "Brottor",
                "Bruenor",
                "Dain",
                "Darrak",
                "Delg",
                "Eberk",
                "Einkil",
                "Fargrim",
                "Flint",
                "Gardain",
                "Harbek",
                "Kildrak",
                "Morgran",
                "Orsik",
                "Oskar",
                "Rangrim",
                "Rurik",
                "Taklinn",
                "Thoradin",
                "Thorin",
                "Tordek",
                "Traubon",
                "Travok",
                "Ulfgar",
                "Veit",
                "Vondal"
            ],
            "nickname": [],
            "order": [
                "first",
                "clan"
            ],
            "surname": [],
            "virtue": []
        },
        "race": "Dwarf",
        "size": {
            "class": "Medium",
            "description": "Dwarves stand between 4 and 5 feet tall and average about 150 pounds. Your size is Medium.",
            "lower": 4.0,
            "upper": 5.0
        },
        "speed": {
            "description": "Your base walking speed is 25 feet. Your speed is not reduced by wearing heavy armor.",
            "speed": 25
        },
        "subraces": [
            {
                "ability_score_increase": {
                    "abilities": {
                        "charisma": 0,
                        "constitution": 0,
                        "dexterity": 0,
                        "intellect": 0,
                        "strength": 0,
                        "wisdom": 1
                    },
                    "description": ""
                },
                "description": "As a hill dwarf, you have keen senses, deep intuition, and remarkable resilience. The gold dwarves of Faerun in their mighty southern kingdom are hill dwarves, as are the exiled Neidar and the debased Klar of Krynn in the Dragonlance setting.",
                "modifiers": [
                    {
                        "description": "Your hit point maximum increases by 1, and it increases by 1 every time you gain a level.",
                        "modifier": "Dwarven Toughness"
                    }
                ],
                "names": {
                    "child": [],
                    "clan": [],
                    "description": "",
                    "family": [],
                    "female": [],
                    "male": [],
                    "nickname": [],
                    "order": [],
                    "surname": [],
                    "virtue": []
                },
                "race": "Hill Dwarf"
            },
            {
                "ability_score_increase": {
                    "abilities": {
                        "charisma": 0,
                        "constitution": 0,
                        "dexterity": 0,
                        "intellect": 0,
                        "strength": 2,
                        "wisdom": 0
                    },
                    "description": ""
                },
                "description": "As a mountain dwarf, you're strong and hardy, accustomed to a difficult life in rugged terrain. You're probably on the tall side (for a dwarf), and tend toward lighter coloration. The shield dwarves of northern Faerun, as well as the ruling Hylar clan and the noble Daewar clan of Dragonlance, are mountain dwarves.",
                "modifiers": [
                    {
                        "description": "You have proficiency with light and medium armor.",
                        "modifier": "Dwarven Armer Training"
                    }
                ],
                "names": {
                    "child": [],
                    "clan": [],
                    "description": "",
                    "family": [],
                    "female": [],
                    "male": [],
                    "nickname": [],
                    "order": [],
                    "surname": [],
                    "virtue": []
                },
                "race": "Mountain Dwarf"
            }
        ]
    },
    {
        "ability_score_increase": {
            "abilities": {
                "charisma": 0,
                "constitution": 0,
                "dexterity": 2,
                "intellect": 0,
                "strength": 0,
                "wisdom": 0
            },
            "description": ""
        },
        "age": {
            "adulthood": 100,
            "description": "Although elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. An elf typically claims adulthood and an adult name around the age of 100 and can live to be 750 years old.",
            "lifespan": 750
        },
        "alignment": {
            "alignment": "CG",
            "description": "Elves love freedom, variety, and self expression, so they lean strongly toward the gentler aspects of chaos. They value and protect others' freedom as well as their own, and they are more often good than not. The drow are an exception; their exile into the Underdark has made them vicious and dangerous. Drow are more often evil than not."
        },
        "description": "Elves are a magical people of otherworldly grace, living in the world but not entirely part of it. They live in places of ethereal beauty, in the midst of ancient forests or in silvery spires glittering with faerie light, where soft music drifts through the air and gentle fragrances waft on the breeze. Elves love nature and magic, art and artistry, music and poetry, and the good things of the world.",
        "languages": [
            "Common",
            "Elvish"
        ],
        "modifiers": [
            {
                "description": "Accustomed to twilit forests and the night sky, you have superior vision in dark and dim conditions.  You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light.  You can't discern color in darkness, only shades of gray",
                "modifier": "Darkvision"
            },
            {
                "description": "You have proficiency in the Perception skill.",
                "modifier": "Keen Senses"
            },
            {
                "description": "You have advantage on saving throws against being charmed, and magic can't put you to sleep.",
                "modifier": "Fey Ancestry"
            },
            {
                "description": "Elves don't need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is \"trance.\") While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep.",
                "modifier": "Trance"
            }
        ],
        "names": {
            "child": [
                "Ara",
                "Bryn",
                "Del",
                "Eryn",
                "Faen",
                "Innil",
                "Lael",
                "Mella",
                "Naill",
                "Naeris",
                "Phann",
                "Rael",
                "Rinn",
                "Sai",
                "Syllin",
                "Thia",
                "Vall"
            ],
            "clan": [],
            "description": "Elves are considered children until they declare themselves adults, sometime after the hundredth birthday, and before this period they are called by child names.  On declaring adulthood, an elf selects an adult name, although those who knew him or her as a youngster might continue to use the child name. Each elf's adult name is a unique creation, though it might reflect the names of respected individuals or other family members. Little distinction exists between male names and female names; the groupings here reflect only general tendencies. In addition, every elf bears a family name, typically a combination of other Elvish words. Some elves traveling among humans translate their family names into Common, but others retain the Elvish version.",
            "family": [
                "Amakiir",
                "Amastacia",
                "Galanodel",
                "Holimion",
                "Ilphelkiir",
                "Liadon",
                "Meliamne",
                "Naïlo",
                "Siannodel",
                "Xiloscient"
            ],
            "female": [
                "Adrie",
                "Althaea",
                "Anastrianna",
                "Andraste",
                "Antinua",
                "Bethrynna",
                "Birel",
                "Caelynn",
                "Drusilia",
                "Enna",
                "Felosial",
                "Ielenia",
                "Jelenneth",
                "Keyleth",
                "Leshanna",
                "Lia",
                "Meriele",
                "Mialee",
                "Naivara",
                "Quelenna",
                "Quillathe",
                "Sariel",
                "Shanairra",
                "Shava",
                "Silaqui",
                "Theirastra",
                "Thia",
                "Vadania",
                "Valanthe",
                "Xanaphia"
            ],
            "male": [
                "Adran",
                "Aelar",
                "Aramil",
                "Arannis",
                "Aust",
                "Beiro",
                "Berrian",
                "Carric",
                "Enialis",
                "Erdan",
                "Erevan",
                "Galinndan",
                "Hadarai",
                "Heian",
                "Himo",
                "Immeral",
                "Ivellios",
                "Laucian",
                "Mindartis",
                "Paelias",
                "Peren",
                "Quarion",
                "Riardon",
                "Rolen",
                "Soveliss",
                "Thamior",
                "Tharivol",
                "Theren",
                "Varis"
            ],
            "nickname": [],
            "order": [
                "first",
                "family"
            ],
            "surname": [],
            "virtue": []
        },
        "race": "Elf",
        "size": {
            "class": "Medium",
            "description": "Elves range from under 5 to over 6 feet tall and have slender builds. Your size is Medium.",
            "lower": 5.0,
            "upper": 6.0
        },
        "speed": {
            "description": "Your base walking speed is 30 feet.",
            "speed": 30
        },
        "subraces": [
            {
                "ability_score_increase": {
                    "abilities": {
                        "charisma": 0,
                        "constitution": 0,
                        "dexterity": 0,
                        "intellect": 1,
                        "strength": 0,
                        "wisdom": 0
                    },
                    "description": ""
                },
                "description": "As a high elf, you have a keen mind and a mastery of at least the basics of magic. In many of the worlds of D&D, there are two kinds of high elves. One type (which includes the gray elves and valley elves of Greyhawk, the Silvanesti of Dragonlance, and the sun elves of the Forgotten Realms) is haughty and reclusive, believing themselves to be superior to non-elves and even other elves. The other type (including the high elves of Greyhawk, the Qualinesti of Dragonlance, and the moon elves of the Forgotten Realms) are more common and more friendly, and often encountered among humans and other races.\n The sun elves of Faerun (also called gold elves or sunrise elves) have bronze skin and hair of copper, black, or golden blond. Their eyes are golden, silver, or black. Moon elves (also called silver elves or gray elves) are much paler, with alabaster skin sometimes tinged with blue.  They often have hair of silver-white, black, or blue, but various shades of blond, brown, and red are not uncommon. Their eyes are blue or green and flecked with gold.",
                "modifiers": [
                    {
                        "description": "You have proficiency with the longsword, shortsword, shortbow, and longbow.",
                        "modifier": "Elf Weapon Training"
                    },
                    {
                        "description": "You know one cantrip of your choice from the wizard spell list. Intelligence is your spellcasting ability for it",
                        "modifier": "Cantrip"
                    },
                    {
                        "description": "You can speak, read, and write one extra language of your choice.",
                        "modifier": "Extra Language"
                    }
                ],
                "names": {
                    "child": [],
                    "clan": [],
                    "description": "",
                    "family": [],
                    "female": [],
                    "male": [],
                    "nickname": [],
                    "order": [],
                    "surname": [],
                    "virtue": []
                },
                "race": "High Elf"
            },
            {
                "ability_score_increase": {
                    "abilities": {
                        "charisma": 0,
                        "constitution": 0,
                        "dexterity": 0,
                        "intellect": 0,
                        "strength": 0,
                        "wisdom": 1
                    },
                    "description": ""
                },
                "description": "As a wood elf, you have keen senses and intuition, and your fleet feet carry you quickly and stealthily through your native forests. This category includes the wild elves (grugach) of Greyhawk and the Kagonesti of Dragonlance, as well as the races called wood elves in Greyhawk and the Forgotten Realms. In Faerun, wood elves (also called wild elves, green elves, or forest elves) are reclusive and distrusting of non-elves.  Wood elves' skin tends to be copperish in hue, sometimes with traces of green. Their hair tends toward browns and blacks, but it is occasionally blond or copper-colored. Their eyes are green, brown, or hazel.",
                "modifiers": [
                    {
                        "description": "You have proficiency with the longsword, shortsword, shortbow, and longbow.",
                        "modifier": "Elf Weapon Training"
                    },
                    {
                        "description": "Your base walking speed increases to 35 feet.",
                        "modifier": "Fleet of Foot"
                    },
                    {
                        "description": "You can attempt to hide even when you are only lightly obscured by foliage, heavy rain, falling snow, mist, and other natural phenomena.",
                        "modifier": "Mask of the Wild"
                    }
                ],
                "names": {
                    "child": [],
                    "clan": [],
                    "description": "",
                    "family": [],
                    "female": [],
                    "male": [],
                    "nickname": [],
                    "order": [],
                    "surname": [],
                    "virtue": []
                },
                "race": "Wood Elf"
            },
            {
                "ability_score_increase": {
                    "abilities": {
                        "charisma": 1,
                        "constitution": 0,
                        "dexterity": 0,
                        "intellect": 0,
                        "strength": 0,
                        "wisdom": 0
                    },
                    "description": ""
                },
                "description": "Descended from an earlier subrace of dark-skinned elves, the drow were banished from the surface world for following the goddess Lolth down the path to evil and corruption. Now they have built their own civilization in the depths of the Underdark, patterned after the Way of Lolth. Also called dark elves, the drow have black skin that resembles polished obsidian and stark white or pale yellow hair. They commonly have very pale eyes (so pale as to be mistaken for white) in shades of lilac, silver, pink, red, and blue. They tend to be smaller and thinner than most elves.",
                "modifiers": [
                    {
                        "description": "Your darkvision has a radius of 120 feet.",
                        "modifier": "Superior Darkvision"
                    },
                    {
                        "description": "You have disadvantage on attack rolls and on Wisdom (Perception) checks that rely on sight when you, the target of your attack, or whatever you are trying to perceive is in direct sunlight.",
                        "modifier": "Sunlight Sensitivity"
                    },
                    {
                        "description": "You know the dancing lights cantrip.  When you reach 3rd level, you can cast the faerie fire spell once per day. When you reach 5th level, you can also cast the darkness spell once per day. Charisma is your spellcasting ability for these spells.",
                        "modifier": "Drow Magic"
                    },
                    {
                        "description": "You have proficiency with rapiers, shortswords, and hand crossbows.",
                        "modifier": "Drow Weapon Training"
                    }
                ],
                "names": {
                    "child": [],
                    "clan": [],
                    "description": "",
                    "family": [],
                    "female": [],
                    "male": [],
                    "nickname": [],
                    "order": [],
                    "surname": [],
                    "virtue": []
                },
                "race": "Dark Elf"
            }
        ]
    },
    {
        "ability_score_increase": {
            "abilities": {
                "charisma": 0,
                "constitution": 0,
                "dexterity": 2,
                "intellect": 0,
                "strength": 0,
                "wisdom": 0
            },
            "description": ""
        },
        "age": {
            "adulthood": 20,
            "description": "A halfling reaches adulthood at the age of 20 and generally lives into the middle of his or her second century.",
            "lifespan": 150
        },
        "alignment": {
            "alignment": "LG",
            "description": "Most halflings are lawful good. As a rule, they are good-hearted and kind, hate to see others in pain, and have no tolerance for oppression. They are also very orderly and traditional, leaning heavily on the support of their community and the comfort of their old ways."
        },
        "description": "The comforts of home are the goals of most halflings' lives: a place to settle in peace and quiet, far from marauding monsters and clashing armies; a blazing fire and a generous meal; fine drink and fine conversation.  Though some halflings live out their days in remote agricultural communities, others form nomadic bands that travel constantly, lured by the open road and the wide horizon to discover the wonders of new lands and peoples. But even these wanderers love peace, food, hearth, and home, though home might be a wagon jostling along an dirt road or a raft floating downriver",
        "languages": [
            "Common",
            "Halfling"
        ],
        "modifiers": [
            {
                "description": "When you roll a 1 on an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll.",
                "modifier": "Lucky"
            },
            {
                "description": "You have advantage on saving throws against being frightened",
                "modifier": "Brave"
            },
            {
                "description": "You can move through the space of any creature that is of a size larger than yours.",
                "modifier": "Halfling Nimbleness"
            }
        ],
        "names": {
            "child": [],
            "clan": [],
            "description": "A halfling has a given name, a family name, and possibly a nickname. Family names are often nicknames that stuck so tenaciously they have been passed down through the generations.",
            "family": [
                "Brushgather",
                "Goodbarrel",
                "Greenbottle",
                "High-hill",
                "Hilltopple",
                "Leagallow",
                "Tealeaf",
                "Thorngage",
                "Tosscobble",
                "Underbough"
            ],
            "female": [
                "Andry",
                "Bree",
                "Callie",
                "Cora",
                "Euphemia",
                "Jillian",
                "Kithri",
                "Lavinia",
                "Lidda",
                "Merla",
                "Nedda",
                "Paela",
                "Portia",
                "Seraphina",
                "Shaena",
                "Trym",
                "Vani",
                "Verna"
            ],
            "male": [
                "Alton",
                "Ander",
                "Cade",
                "Corrin",
                "Eldon",
                "Errich",
                "Finnan",
                "Garret",
                "Lindal",
                "Lyle",
                "Merric",
                "Milo",
                "Osborn",
                "Perrin",
                "Reed",
                "Roscoe",
                "Wellby"
            ],
            "nickname": [],
            "order": [
                "first",
                "family",
                "nickname"
            ],
            "surname": [],
            "virtue": []
        },
        "race": "Halfling",
        "size": {
            "class": "Small",
            "description": "Halflings average about 3 feet tall and weigh about 40 pounds. Your size is Small.",
            "lower": 3.0,
            "upper": 3.0
        },
        "speed": {
            "description": "Your base walking speed is 25 feet.",
            "speed": 25
        },
        "subraces": [
            {
                "ability_score_increase": {
                    "abilities": {
                        "charisma": 1,
                        "constitution": 0,
                        "dexterity": 0,
                        "intellect": 0,
                        "strength": 0,
                        "wisdom": 0
                    },
                    "description": ""
                },
                "description": "As a lightfoot halfling, you can easily hide from notice, even using other people as cover. You're inclined to be affable and get along well with others. In the Forgotten Realms, lightfoot halflings have spread the farthest and thus are the most common variety.\n Lightfoots are more prone to wanderlust than other halflings, and often dwell alongside other races or take up a nomadic life. In the world of Greyhawk, these halflings are called hairfeet or tallfellows.",
                "modifiers": [
                    {
                        "description": "You can attempt to hide even when you are obscured only by a creature that is at least one size larger than you.",
                        "modifier": "Naturally Stealthy"
                    }
                ],
                "names": {
                    "child": [],
                    "clan": [],
                    "description": "",
                    "family": [],
                    "female": [],
                    "male": [],
                    "nickname": [],
                    "order": [],
                    "surname": [],
                    "virtue": []
                },
                "race": "Lightfoot"
            },
            {
                "ability_score_increase": {
                    "abilities": {
                        "charisma": 0,
                        "constitution": 1,
                        "dexterity": 0,
                        "intellect": 0,
                        "strength": 0,
                        "wisdom": 0
                    },
                    "description": ""
                },
                "description": "As a stout halfling, you're hardier than average and have some resistance to poison. Some say that stouts have dwarven blood. In the Forgotten Realms, these halflings are called stronghearts, and they're most common in the south.",
                "modifiers": [
                    {
                        "description": "You have advantage on saving throws against poison, and you have resistance against poison damage.",
                        "modifier": "Stout Resilience"
                    }
                ],
                "names": {
                    "child": [],
                    "clan": [],
                    "description": "",
                    "family": [],
                    "female": [],
                    "male": [],
                    "nickname": [],
                    "order": [],
                    "surname": [],
                    "virtue": []
                },
                "race": "Stout"
            }
        ]
    },
    {
        "ability_score_increase": {
            "abilities": {
                "charisma": 1,
                "constitution": 1,
                "dexterity": 1,
                "intellect": 1,
                "strength": 1,
                "wisdom": 1
            },
            "description": ""
        },
        "age": {
            "adulthood": 18,
            "description": "Humans reach adulthood in their late teens and live less than a century.",
            "lifespan": 90
        },
        "alignment": {
            "alignment": "N",
            "description": "Humans tend toward no particular alignment. The best and the worst are found among them."
        },
        "description": "In the reckonings of most worlds, humans are the youngest of the common races, late to arrive on the world scene and short-lived in comparison to dwarves, elves, and dragons. Perhaps it is because of their shorter lives that they strive to achieve as much as they can in the years they are given. Or maybe they feel they have something to prove to the elder races, and that's why they build their mighty empires on the foundation of conquest and trade. Whatever drives them, humans are the innovators, the achievers, and the pioneers of the worlds.",
        "languages": [
            "Common",
            "Any"
        ],
        "modifiers": [],
        "names": {
            "child": [],
            "clan": [],
            "description": "",
            "family": [],
            "female": [],
            "male": [],
            "nickname": [],
            "order": [
                "first",
                "surname"
            ],
            "surname": [],
            "virtue": []
        },
        "race": "Human",
        "size": {
            "class": "Medium",
            "description": "Humans vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium.",
            "lower": 4.0,
            "upper": 7.0
        },
        "speed": {
            "description": "Your base walking speed is 30 feet.",
            "speed": 30
        },
        "subraces": [
            {
                "ability_score_increase": {
                    "abilities": {
                        "charisma": 0,
                        "constitution": 0,
                        "dexterity": 0,
                        "intellect": 0,
                        "strength": 0,
                        "wisdom": 0
                    },
                    "description": ""
                },
                "description": "Shorter and slighter in build than most other humans, Calishites have dusky brown skin, hair, and eyes.  They're found primarily in southwest Faerun.",
                "modifiers": [
                    {
                        "description": "",
                        "modifier": ""
                    }
                ],
                "names": {
                    "child": [],
                    "clan": [],
                    "description": "",
                    "family": [],
                    "female": [
                        "Atala",
                        "Ceidil",
                        "Hama",
                        "Jasmal",
                        "Meilil",
                        "Seipora",
                        "Yasheira",
                        "Zasheida"
                    ],
                    "male": [
                        "Aseir",
                        "Bardeid",
                        "Haseid",
                        "Khemed",
                        "Mehmen",
                        "Sudeiman",
                        "Zasheir"
                    ],
                    "nickname": [],
                    "order": [],
                    "surname": [
                        "Basha",
                        "Dumein",
                        "Jassan",
                        "Khalid",
                        "Mostana",
                        "Pashar",
                        "Rein"
                    ],
                    "virtue": []
                },
                "race": "Calishite"
            },
            {
                "ability_score_increase": {
                    "abilities": {
                        "charisma": 0,
                        "constitution": 0,
                        "dexterity": 0,
                        "intellect": 0,
                        "strength": 0,
                        "wisdom": 0
                    },
                    "description": ""
                },
                "description": "Chondathans are slender, tawny-skinned folk with brown hair that ranges from almost blond to almost black. Most are tall and have green or brown eyes, but these traits are hardly universal. Humans of Chondathan descent dominate the central lands of Faerun, around the Inner Sea.",
                "modifiers": [
                    {
                        "description": "",
                        "modifier": ""
                    }
                ],
                "names": {
                    "child": [],
                    "clan": [],
                    "description": "",
                    "family": [],
                    "female": [
                        "Arveene",
                        "Esvele",
                        "Jhessail",
                        "Kerri",
                        "Lureene",
                        "Miri",
                        "Rowan",
                        "Shandri",
                        "Tessele"
                    ],
                    "male": [
                        "Darvin",
                        "Dorn",
                        "Evendur",
                        "Gorstag",
                        "Grim",
                        "Helm",
                        "Malark",
                        "Morn",
                        "Randal",
                        "Stedd"
                    ],
                    "nickname": [],
                    "order": [],
                    "surname": [
                        "Amblecrown",
                        "Buckman",
                        "Dundragon",
                        "Evenwood",
                        "Greycastle",
                        "Tallstag"
                    ],
                    "virtue": []
                },
                "race": "Chondathan"
            },
            {
                "ability_score_increase": {
                    "abilities": {
                        "charisma": 0,
                        "constitution": 0,
                        "dexterity": 0,
                        "intellect": 0,
                        "strength": 0,
                        "wisdom": 0
                    },
                    "description": ""
                },
                "description": "Found primarily in the northwest of Faerun, Damarans are of moderate height and build, with skin hues ranging from tawny to fair. Their hair is usually brown or black, and their eye color varies widely, though brown is most common.",
                "modifiers": [
                    {
                        "description": "",
                        "modifier": ""
                    }
                ],
                "names": {
                    "child": [],
                    "clan": [],
                    "description": "",
                    "family": [],
                    "female": [
                        "Alethra",
                        "Kara",
                        "Katernin",
                        "Mara",
                        "Natali",
                        "Olma",
                        "Tana",
                        "Zora"
                    ],
                    "male": [
                        "Bor",
                        "Fodel",
                        "Glar",
                        "Grigor",
                        "Igan",
                        "Ivor",
                        "Kosef",
                        "Mival",
                        "Orel",
                        "Pavel",
                        "Sergor"
                    ],
                    "nickname": [],
                    "order": [],
                    "surname": [
                        "Bersk",
                        "Chernin",
                        "Dotsk",
                        "Kulenov",
                        "Marsk",
                        "Nemetsk",
                        "Shemov",
                        "Starag"
                    ],
                    "virtue": []
                },
                "race": "Damaran"
            },
            {
                "ability_score_increase": {
                    "abilities": {
                        "charisma": 0,
                        "constitution": 0,
                        "dexterity": 0,
                        "intellect": 0,
                        "strength": 0,
                        "wisdom": 0
                    },
                    "description": ""
                },
                "description": "Illuskans are tall, fair-skinned folk with blue or steely gray eyes. Most have raven-black hair, but those who inhabit the extreme northwest have blond, red, or light brown hair.",
                "modifiers": [
                    {
                        "description": "",
                        "modifier": ""
                    }
                ],
                "names": {
                    "child": [],
                    "clan": [],
                    "description": "",
                    "family": [],
                    "female": [
                        "Amafrey",
                        "Betha",
                        "Cefrey",
                        "Kethra",
                        "Mara",
                        "Olga",
                        "Silifrey",
                        "Westra"
                    ],
                    "male": [
                        "Ander",
                        "Blath",
                        "Bran",
                        "Frath",
                        "Geth",
                        "Lander",
                        "Luth",
                        "Malcer",
                        "Stor",
                        "Taman",
                        "Urth"
                    ],
                    "nickname": [],
                    "order": [],
                    "surname": [
                        "Brightwood",
                        "Helder",
                        "Hornraven",
                        "Lackman",
                        "Stormwind",
                        "Windrivver"
                    ],
                    "virtue": []
                },
                "race": "Illuskan"
            },
            {
                "ability_score_increase": {
                    "abilities": {
                        "charisma": 0,
                        "constitution": 0,
                        "dexterity": 0,
                        "intellect": 0,
                        "strength": 0,
                        "wisdom": 0
                    },
                    "description": ""
                },
                "description": "Dominant in the eastern and southeastern shores of the Inner Sea, the Mulan are generally tall, slim, and amber-skinned, with eyes of hazel or brown. Their hair ranges from black to dark brown, but in the lands where the Mulan are most prominent, nobles and many other Mulan shave off all their hair.",
                "modifiers": [
                    {
                        "description": "",
                        "modifier": ""
                    }
                ],
                "names": {
                    "child": [],
                    "clan": [],
                    "description": "",
                    "family": [],
                    "female": [
                        "Arizima",
                        "Chathi",
                        "Nephis",
                        "Nulara",
                        "Murithi",
                        "Sefris",
                        "Thola",
                        "Umara",
                        "Zolis"
                    ],
                    "male": [
                        "Aoth",
                        "Bareris",
                        "Ehput-Ki",
                        "Kethoth",
                        "Mumed",
                        "Ramas",
                        "So-Kehur",
                        "Thazar-De",
                        "Urhur"
                    ],
                    "nickname": [],
                    "order": [],
                    "surname": [
                        "Ankhalab",
                        "Anskuld",
                        "Fezim",
                        "Hahpet",
                        "Nathandem",
                        "Sepret",
                        "Uuthrakt"
                    ],
                    "virtue": []
                },
                "race": "Mulan"
            },
            {
                "ability_score_increase": {
                    "abilities": {
                        "charisma": 0,
                        "constitution": 0,
                        "dexterity": 0,
                        "intellect": 0,
                        "strength": 0,
                        "wisdom": 0
                    },
                    "description": ""
                },
                "description": "Most often found east of the Inner Sea and often intermingled with the Mulan, Rashem is tend to be short, stout, and muscular. They usually have dusky skin, dark eyes, and thick black hair.",
                "modifiers": [
                    {
                        "description": "",
                        "modifier": ""
                    }
                ],
                "names": {
                    "child": [],
                    "clan": [],
                    "description": "",
                    "family": [],
                    "female": [
                        "Fyevarra",
                        "Hulmarra",
                        "Immith",
                        "Imzel",
                        "Navarra",
                        "Shevarra",
                        "Tammith",
                        "Yuldra"
                    ],
                    "male": [
                        "Borivik",
                        "Faurgar",
                        "Jandar",
                        "Kanithar",
                        "Madislak",
                        "Ralmevik",
                        "Shaumar",
                        "Vladislak"
                    ],
                    "nickname": [],
                    "order": [],
                    "surname": [
                        "Chergoba",
                        "Dyernina",
                        "Iltazyara",
                        "Murnyethara",
                        "Stayanoga",
                        "Ulmokina"
                    ],
                    "virtue": []
                },
                "race": "Rashemi"
            },
            {
                "ability_score_increase": {
                    "abilities": {
                        "charisma": 0,
                        "constitution": 0,
                        "dexterity": 0,
                        "intellect": 0,
                        "strength": 0,
                        "wisdom": 0
                    },
                    "description": ""
                },
                "description": "The Shou are the most numerous and powerful ethnic group in Kara-Tur, far to the east of Faerun. They are yellowish-bronze in hue, with black hair and dark eyes. Shou surnames are usually presented before the given name.",
                "modifiers": [
                    {
                        "description": "",
                        "modifier": ""
                    }
                ],
                "names": {
                    "child": [],
                    "clan": [],
                    "description": "",
                    "family": [],
                    "female": [
                        "Bai",
                        "Chao",
                        "Jia",
                        "Lei",
                        "Mei",
                        "Qiao",
                        "Shui",
                        "Tai"
                    ],
                    "male": [
                        "An",
                        "Chen",
                        "Chi",
                        "Fai",
                        "Jiang",
                        "Jun",
                        "Lian",
                        "Long",
                        "Meng",
                        "On",
                        "Shan",
                        "Shui",
                        "Wen"
                    ],
                    "nickname": [],
                    "order": [
                        "surname",
                        "first"
                    ],
                    "surname": [
                        "Chien",
                        "Huang",
                        "Kao",
                        "Kung",
                        "Lao",
                        "Ling",
                        "Mei",
                        "Pin",
                        "Shin",
                        "Sum",
                        "Tan",
                        "Wan"
                    ],
                    "virtue": []
                },
                "race": "Shou"
            },
            {
                "ability_score_increase": {
                    "abilities": {
                        "charisma": 0,
                        "constitution": 0,
                        "dexterity": 0,
                        "intellect": 0,
                        "strength": 0,
                        "wisdom": 0
                    },
                    "description": ""
                },
                "description": "Widespread along the entire Sword Coast at the western edge of Faerun, Tethyrians are of medium build and height, with dusky skin that tends to grow fairer the farther north they dwell. Their hair and eye color varies widely, but brown hair and blue eyes are the most common. Tethyrians primarily use Chondathan names.",
                "modifiers": [
                    {
                        "description": "",
                        "modifier": ""
                    }
                ],
                "names": {
                    "child": [],
                    "clan": [],
                    "description": "",
                    "family": [],
                    "female": [
                        "Arveene",
                        "Esvele",
                        "Jhessail",
                        "Kerri",
                        "Lureene",
                        "Miri",
                        "Rowan",
                        "Shandri",
                        "Tessele"
                    ],
                    "male": [
                        "Darvin",
                        "Dorn",
                        "Evendur",
                        "Gorstag",
                        "Grim",
                        "Helm",
                        "Malark",
                        "Morn",
                        "Randal",
                        "Stedd"
                    ],
                    "nickname": [],
                    "order": [],
                    "surname": [
                        "Amblecrown",
                        "Buckman",
                        "Dundragon",
                        "Evenwood",
                        "Greycastle",
                        "Tallstag"
                    ],
                    "virtue": []
                },
                "race": "Thethyrian"
            },
            {
                "ability_score_increase": {
                    "abilities": {
                        "charisma": 0,
                        "constitution": 0,
                        "dexterity": 0,
                        "intellect": 0,
                        "strength": 0,
                        "wisdom": 0
                    },
                    "description": ""
                },
                "description": "Native to the southern shore of the Inner Sea, the Turami people are generally tall and muscular, with dark mahogany skin, curly black hair, and dark eyes.",
                "modifiers": [
                    {
                        "description": "",
                        "modifier": ""
                    }
                ],
                "names": {
                    "child": [],
                    "clan": [],
                    "description": "",
                    "family": [],
                    "female": [
                        "Balama",
                        "Dona",
                        "Faila",
                        "Jalana",
                        "Luisa",
                        "Marta",
                        "Quara",
                        "Selise",
                        "Vonda"
                    ],
                    "male": [
                        "Anton",
                        "Diero",
                        "Marcon",
                        "Pieron",
                        "Rimardo",
                        "Romero",
                        "Salazar",
                        "Umbero"
                    ],
                    "nickname": [],
                    "order": [],
                    "surname": [
                        "Agosto",
                        "Astorio",
                        "Calabra",
                        "Domine",
                        "Falone",
                        "Marivaldi",
                        "Pisacar",
                        "Ramondo"
                    ],
                    "virtue": []
                },
                "race": "Turami"
            }
        ]
    },
    {
        "ability_score_increase": {
            "abilities": {
                "charisma": 1,
                "constitution": 0,
                "dexterity": 0,
                "intellect": 0,
                "strength": 2,
                "wisdom": 0
            },
            "description": "Your Strength score increases by 2, and your Charisma score increases by 1."
        },
        "age": {
            "adulthood": 15,
            "description": "Young dragonborn grow quickly. They walk hours after hatching, attain the size and development of a 10-year-old human child by the age of 3, and reach adulthood by 15. They live to be around 80.",
            "lifespan": 80
        },
        "alignment": {
            "alignment": "CG",
            "description": "Dragonborn tend to extremes, making a conscious choice for one side or the other in the cosmic war between good and evil (represented by Bahamut and Tiamat, respectively). Most dragonborn are good, but those who side with Tiamat can be terrible villains."
        },
        "description": "Born of dragons, as their name proclaims, the dragonborn walk proudly through a world that greets them with fearful incomprehension. Shaped by draconic gods or the dragons themselves, dragonborn originally hatched from dragon eggs as a unique race, combining the best attributes of dragons and humanoids. S om e dragonborn are faithful servants to true dragons, others form the ranks o f soldiers in great wars, and still others find themselves adrift, with no clear calling in life.",
        "languages": [
            "Common",
            "Draconic"
        ],
        "modifiers": [
            {
                "description": "You have draconic ancestry.  Choose one type of dragon from the Draconic Ancestry table. Your breath weapon and damage resistance are determined by the dragon type, as shown in the table.",
                "modifier": "Draconic Ancestry"
            },
            {
                "description": "You can use your action to exhale destructive energy. Your draconic ancestry determines the size, shape, and damage type of the exhalation.\n When you use your breath weapon, each creature in the area of the exhalation must make a saving throw, the type of which is determined by your draconic ancestry. The DC for this saving throw equals 8 + your Constitution modifier + your proficiency bonus. A creature takes 2d6 damage on a failed save, and half as much damage on a successful one. The damage increases to 3d6 at 6th level, 4d6 at 11th level, and 5d6 at 16th level.\n After you use your breath weapon, you can't use it again until you complete a short or long rest.",
                "modifier": "Breath Weapon"
            },
            {
                "description": "You have resistance to the damage type associated with your draconic ancestry.",
                "modifier": "Damage Resistance"
            }
        ],
        "names": {
            "child": [
                "Climber",
                "Earbender",
                "Leaper",
                "Pious",
                "Shieldbiter",
                "Zealous"
            ],
            "clan": [
                "Clethtinthiallor",
                "Daardendrian",
                "Delmirev",
                "Drachedandion",
                "Fenkenkabradon",
                "Kepeshkmolik",
                "Kerrhylon",
                "Kimbatuul",
                "Linxakasendalor",
                "Myastan",
                "Nemmonis",
                "Norixius",
                "Ophinshtalajiir",
                "Prexijandilin",
                "Shestendeliath",
                "Turnuroth",
                "Verthisathurgiesh",
                "Yarjerit"
            ],
            "description": "Dragonborn have personal names given at birth, but they put their clan names first as a mark of honor. A childhood name or nickname is often used among clutchmates as a descriptive term or a term of endearment. The name might recall an event or center on a habit.",
            "family": [],
            "female": [
                "Akra",
                "Biri",
                "Daar",
                "Farideh",
                "Harann",
                "Flavilar",
                "Jheri",
                "Kava",
                "Korinn",
                "Mishann",
                "Nala",
                "Perra",
                "Raiann",
                "Sora",
                "Surina",
                "Thava",
                "Uadjit"
            ],
            "male": [
                "Arjhan",
                "Balasar",
                "Bharash",
                "Donaar",
                "Ghesh",
                "Heskan",
                "Kriv",
                "Medrash",
                "Mehen",
                "Nadarr",
                "Pandjed",
                "Patrin",
                "Rhogar",
                "Shamash",
                "Shedinn",
                "Tarhun",
                "Torinn"
            ],
            "nickname": [],
            "order": [
                "child",
                "first",
                "clan"
            ],
            "surname": [],
            "virtue": []
        },
        "race": "Dragonborn",
        "size": {
            "class": "Medium",
            "description": "Dragonborn are taller and heavier than humans, standing well over 6 feet tall and averaging almost 250 pounds. Your size is Medium.",
            "lower": 6.0,
            "upper": 8.0
        },
        "speed": {
            "description": "Your base walking speed is 30 feet.",
            "speed": 30
        },
        "subraces": []
    },
    {
        "ability_score_increase": {
            "abilities": {
                "charisma": 0,
                "constitution": 0,
                "dexterity": 0,
                "intellect": 2,
                "strength": 0,
                "wisdom": 0
            },
            "description": "Your Intelligence score increases by 2."
        },
        "age": {
            "adulthood": 40,
            "description": "Gnomes mature at the same rate humans do, and most are expected to settle down into an adult life by around age 40. They can live 350 to almost 500 years",
            "lifespan": 500
        },
        "alignment": {
            "alignment": "CG",
            "description": "Gnomes are most often good. Those who tend toward law are sages, engineers, researchers, scholars, investigators, or inventors. Those who tend toward chaos are minstrels, tricksters, wanderers, or fanciful jewelers. Gnomes are good-hearted, and even the tricksters among them are more playful than vicious."
        },
        "description": "A constant hum of busy activity pervades the warrens and neighborhoods where gnomes form their closeknit communities. Louder sounds punctuate the hum: a crunch of grinding gears here, a minor explosion there, a yelp of surprise or triumph, and especially bursts of laughter. Gnomes take delight in life, enjoying every moment of invention, exploration, investigation, creation, and play",
        "languages": [
            "Common",
            "Gnomish"
        ],
        "modifiers": [
            {
                "description": "Accustom ed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.",
                "modifier": "Darkvision"
            },
            {
                "description": "You have advantage on all Intelligence, Wisdom, and Charisma saving throws against magic.",
                "modifier": "Gnome Cunning"
            }
        ],
        "names": {
            "child": [],
            "clan": [
                "Beren",
                "Daergel",
                "Folkor",
                "Garrick",
                "Nackle",
                "Murnig",
                "Ningel",
                "Raulnor",
                "Scheppen",
                "Timbers",
                "Turen"
            ],
            "description": "",
            "family": [],
            "female": [
                "Bimpnottin",
                "Breena",
                "Caramip",
                "Carlin",
                "Donella",
                "Duvamil",
                "Ella",
                "Ellyjobell",
                "Ellywick",
                "Lilli",
                "Loopmottin",
                "Lorilla",
                "Mardnab",
                "Nissa",
                "Nyx",
                "Oda",
                "Orla",
                "Roywyn",
                "Shamil",
                "Tana",
                "Waywocket",
                "Zanna"
            ],
            "male": [
                "Alston",
                "Alvyn",
                "Boddynock",
                "Brocc",
                "Burgell",
                "Dimble",
                "Eldon",
                "Erky",
                "Fonkin",
                "Frug",
                "Gerbo",
                "Gimble",
                "Glim",
                "Jebeddo",
                "Kellen",
                "Namfoodle",
                "Orryn",
                "Roondar",
                "Seebo",
                "Sindri",
                "Warryn",
                "Wrenn",
                "Zook"
            ],
            "nickname": [
                "Aleslosh",
                "Ashhearth",
                "Badger",
                "Cloak",
                "Doublelock",
                "Filchbatter",
                "Fnipper",
                "Ku",
                "Nim",
                "Oneshoe",
                "Pock",
                "Sparklegem",
                "Stumbleduck"
            ],
            "order": [
                "first",
                "clan",
                "nickname"
            ],
            "surname": [],
            "virtue": []
        },
        "race": "Gnome",
        "size": {
            "class": "Small",
            "description": "Gnomes are between 3 and 4 feet tall and average about 40 pounds. Your size is Small.",
            "lower": 3.0,
            "upper": 4.0
        },
        "speed": {
            "description": "Your base walking speed is 25 feet.",
            "speed": 25
        },
        "subraces": [
            {
                "ability_score_increase": {
                    "abilities": {
                        "charisma": 0,
                        "constitution": 0,
                        "dexterity": 1,
                        "intellect": 0,
                        "strength": 0,
                        "wisdom": 0
                    },
                    "description": ""
                },
                "description": "As a forest gnome, you have a natural knack for illusion and inherent quickness and stealth. In the worlds of D&D, forest gnomes are rare and secretive. They gather in hidden com m unities in sylvan forests, using illusions and trickery to conceal themselves from threats or to m ask their escape should they be detected. Forest gnomes tend to be friendly with other good-spirited woodland folk, and they regard elves and good fey as their most important allies. These gnomes also befriend small forest animals and rely on them for information about threats that might prowl their lands.",
                "modifiers": [
                    {
                        "description": "You know the minor illusion cantrip. Intelligence is your spellcasting ability for it.",
                        "modifier": "Natural Illusionist"
                    },
                    {
                        "description": "Through sounds and gestures, you can communicate simple ideas with Small or smaller beasts. Forest gnomes love animals and often keep squirrels, badgers, rabbits, moles, woodpeckers, and other creatures as beloved pets.",
                        "modifier": "Speak with Small Beasts"
                    }
                ],
                "names": {
                    "child": [],
                    "clan": [],
                    "description": "",
                    "family": [],
                    "female": [],
                    "male": [],
                    "nickname": [],
                    "order": [],
                    "surname": [],
                    "virtue": []
                },
                "race": "Forest Gnome"
            },
            {
                "ability_score_increase": {
                    "abilities": {
                        "charisma": 0,
                        "constitution": 1,
                        "dexterity": 0,
                        "intellect": 0,
                        "strength": 0,
                        "wisdom": 0
                    },
                    "description": ""
                },
                "description": "As a rock gnome, you have a natural inventiveness and hardiness beyond that of other gnomes. Most gnomes in the worlds of D&D are rock gnomes, including the tinker gnomes of the Dragonlance setting.",
                "modifiers": [
                    {
                        "description": "Whenever you make an Intelligence (History) check related to magic items, alchemical objects, or technological devices, you can add twice your proficiency bonus, instead of any proficiency bonus you normally apply.",
                        "modifier": "Artificer's Lore"
                    },
                    {
                        "description": "You have proficiency with artisan's tools (tinker's tools). Using those tools, you can spend 1 hour and 10 gp worth of materials to construct a Tiny clockwork device (AC 5, 1 hp). The device ceases to function after 24 hours (unless you spend 1 hour repairing it to keep the device functioning), or when you use your action to dismantle it; at that time, you can reclaim the materials used to create it. You can have up to three such devices active at a time.\n When you create a device, choose one of the following options:\n Clockwork Toy. This toy is a clockwork animal, monster, or person, such as a frog, mouse, bird, dragon, or soldier. When placed on the ground, the toy moves 5 feet across the ground on each of your turns in a random direction. It makes noises as appropriate to the creature it represents.\n Fire Starter. The device produces a miniature flame, which you can use to light a candle, torch, or campfire. Using the device requires your action.\n Music Box. When opened, this music box plays a single song at a moderate volume.  The box stops playing when it reaches the song's end or when it is closed.",
                        "modifier": "Tinker"
                    }
                ],
                "names": {
                    "child": [],
                    "clan": [],
                    "description": "",
                    "family": [],
                    "female": [],
                    "male": [],
                    "nickname": [],
                    "order": [],
                    "surname": [],
                    "virtue": []
                },
                "race": "Rock Gnome"
            }
        ]
    },
    {
        "ability_score_increase": {
            "abilities": {
                "charisma": 2,
                "constitution": 0,
                "dexterity": 0,
                "intellect": 0,
                "strength": 0,
                "wisdom": 0
            },
            "description": "Your Charisma score increases by 2, and two other ability scores of your choice increase by 1."
        },
        "age": {
            "adulthood": 20,
            "description": "Half-elves mature at the same rate humans do and reach adulthood around the age of 20. They live much longer than humans, however, often exceeding 180 years.",
            "lifespan": 180
        },
        "alignment": {
            "alignment": "CN",
            "description": "Half-elves share the chaotic bent of their elven heritage. They value both personal freedom and creative expression, demonstrating neither love of leaders nor desire for followers. They chafe at rules, resent others' demands, and sometimes prove unreliable, or at least unpredictable."
        },
        "description": "Walking in two worlds but truly belonging to neither, half-elves combine what some say are the best qualities of their elf and human parents: human curiosity, inventiveness, and ambition tempered by the refined senses, love of nature, and artistic tastes o f the elves.  Some half-elves live among humans, set apart by their emotional and physical differences, watching friends and loved ones age while time barely touches them.  Others live with the elves, growing restless as they reach adulthood in the timeless elven realms, while their peers continue to live as children. Many half-elves, unable to fit into either society, choose lives of solitary wandering or join with other misfits and outcasts in the adventuring life.",
        "languages": [
            "Common",
            "Elvish",
            "Any"
        ],
        "modifiers": [
            {
                "description": "Thanks to your elf blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.",
                "modifier": "Darkvision"
            },
            {
                "description": "You have advantage on saving throws against being charm ed, and magic can't put you to sleep.",
                "modifier": "Fey Ancestry"
            },
            {
                "description": "You gain proficiency in two skills of your choice.",
                "modifier": "Skill Versatility"
            }
        ],
        "names": {
            "child": [],
            "clan": [],
            "description": "Half-elves use either human or elven naming conventions. As if to emphasize that they don't really fit in to either society, half-elves raised among humans are often given elven names, and those raised among elves often take human names.",
            "family": [],
            "female": [
                "Adrie",
                "Alethra",
                "Althaea",
                "Amafrey",
                "Anastrianna",
                "Andraste",
                "Antinua",
                "Arizima",
                "Arveene",
                "Arveene",
                "Atala",
                "Bai",
                "Balama",
                "Betha",
                "Bethrynna",
                "Birel",
                "Caelynn",
                "Cefrey",
                "Ceidil",
                "Chao",
                "Chathi",
                "Dona",
                "Drusilia",
                "Enna",
                "Esvele",
                "Esvele",
                "Faila",
                "Felosial",
                "Fyevarra",
                "Hama",
                "Hulmarra",
                "Ielenia",
                "Immith",
                "Imzel",
                "Jalana",
                "Jasmal",
                "Jelenneth",
                "Jhessail",
                "Jhessail",
                "Jia",
                "Kara",
                "Katernin",
                "Kerri",
                "Kerri",
                "Kethra",
                "Keyleth",
                "Lei",
                "Leshanna",
                "Lia",
                "Luisa",
                "Lureene",
                "Lureene",
                "Mara",
                "Mara",
                "Marta",
                "Mei",
                "Meilil",
                "Meriele",
                "Mialee",
                "Miri",
                "Miri",
                "Murithi",
                "Naivara",
                "Natali",
                "Navarra",
                "Nephis",
                "Nulara",
                "Olga",
                "Olma",
                "Qiao",
                "Quara",
                "Quelenna",
                "Quillathe",
                "Rowan",
                "Rowan",
                "Sariel",
                "Sefris",
                "Seipora",
                "Selise",
                "Shanairra",
                "Shandri",
                "Shandri",
                "Shava",
                "Shevarra",
                "Shui",
                "Silaqui",
                "Silifrey",
                "Tai",
                "Tammith",
                "Tana",
                "Tessele",
                "Tessele",
                "Theirastra",
                "Thia",
                "Thola",
                "Umara",
                "Vadania",
                "Valanthe",
                "Vonda",
                "Westra",
                "Xanaphia",
                "Yasheira",
                "Yuldra",
                "Zasheida",
                "Zolis",
                "Zora"
            ],
            "male": [
                "Adran",
                "Aelar",
                "An",
                "Ander",
                "Anton",
                "Aoth",
                "Aramil",
                "Arannis",
                "Aseir",
                "Aust",
                "Bardeid",
                "Bareris",
                "Beiro",
                "Berrian",
                "Blath",
                "Bor",
                "Borivik",
                "Bran",
                "Carric",
                "Chen",
                "Chi",
                "Darvin",
                "Darvin",
                "Diero",
                "Dorn",
                "Dorn",
                "Ehput-Ki",
                "Enialis",
                "Erdan",
                "Erevan",
                "Evendur",
                "Evendur",
                "Fai",
                "Faurgar",
                "Fodel",
                "Frath",
                "Galinndan",
                "Geth",
                "Glar",
                "Gorstag",
                "Gorstag",
                "Grigor",
                "Grim",
                "Grim",
                "Hadarai",
                "Haseid",
                "Heian",
                "Helm",
                "Helm",
                "Himo",
                "Igan",
                "Immeral",
                "Ivellios",
                "Ivor",
                "Jandar",
                "Jiang",
                "Jun",
                "Kanithar",
                "Kethoth",
                "Khemed",
                "Kosef",
                "Lander",
                "Laucian",
                "Lian",
                "Long",
                "Luth",
                "Madislak",
                "Malark",
                "Malark",
                "Malcer",
                "Marcon",
                "Mehmen",
                "Meng",
                "Mindartis",
                "Mival",
                "Morn",
                "Morn",
                "Mumed",
                "On",
                "Orel",
                "Paelias",
                "Pavel",
                "Peren",
                "Pieron",
                "Quarion",
                "Ralmevik",
                "Ramas",
                "Randal",
                "Randal",
                "Riardon",
                "Rimardo",
                "Rolen",
                "Romero",
                "Salazar",
                "Sergor",
                "Shan",
                "Shaumar",
                "Shui",
                "So-Kehur",
                "Soveliss",
                "Stedd",
                "Stedd",
                "Stor",
                "Sudeiman",
                "Taman",
                "Thamior",
                "Tharivol",
                "Thazar-De",
                "Theren",
                "Umbero",
                "Urhur",
                "Urth",
                "Varis",
                "Vladislak",
                "Wen",
                "Zasheir"
            ],
            "nickname": [],
            "order": [
                "first",
                "surname"
            ],
            "surname": [
                "Agosto",
                "Amakiir",
                "Amastacia",
                "Amblecrown",
                "Amblecrown",
                "Ankhalab",
                "Anskuld",
                "Astorio",
                "Basha",
                "Bersk",
                "Brightwood",
                "Buckman",
                "Buckman",
                "Calabra",
                "Chergoba",
                "Chernin",
                "Chien",
                "Domine",
                "Dotsk",
                "Dumein",
                "Dundragon",
                "Dundragon",
                "Dyernina",
                "Evenwood",
                "Evenwood",
                "Falone",
                "Fezim",
                "Galanodel",
                "Greycastle",
                "Greycastle",
                "Hahpet",
                "Helder",
                "Holimion",
                "Hornraven",
                "Huang",
                "Ilphelkiir",
                "Iltazyara",
                "Jassan",
                "Kao",
                "Khalid",
                "Kulenov",
                "Kung",
                "Lackman",
                "Lao",
                "Liadon",
                "Ling",
                "Marivaldi",
                "Marsk",
                "Mei",
                "Meliamne",
                "Mostana",
                "Murnyethara",
                "Naïlo",
                "Nathandem",
                "Nemetsk",
                "Pashar",
                "Pin",
                "Pisacar",
                "Ramondo",
                "Rein",
                "Sepret",
                "Shemov",
                "Shin",
                "Siannodel",
                "Starag",
                "Stayanoga",
                "Stormwind",
                "Sum",
                "Tallstag",
                "Tallstag",
                "Tan",
                "Ulmokina",
                "Uuthrakt",
                "Wan",
                "Windrivver",
                "Xiloscient"
            ],
            "virtue": []
        },
        "race": "Half-Elf",
        "size": {
            "class": "Medium",
            "description": "Half-elves are about the same size as humans, ranging from 5 to 6 feet tall. Your size is Medium.",
            "lower": 5.0,
            "upper": 6.0
        },
        "speed": {
            "description": "Your base walking speed is 30 feet.",
            "speed": 30
        },
        "subraces": []
    },
    {
        "ability_score_increase": {
            "abilities": {
                "charisma": 0,
                "constitution": 1,
                "dexterity": 0,
                "intellect": 0,
                "strength": 2,
                "wisdom": 0
            },
            "description": ""
        },
        "age": {
            "adulthood": 14,
            "description": "Half-orcs mature a little faster than humans, reaching adulthood around age 14. They age noticeably faster and rarely live longer than 75 years.",
            "lifespan": 75
        },
        "alignment": {
            "alignment": "CG",
            "description": "Half-orcs inherit a tendency toward chaos from their orc parents and are not strongly inclined toward good. Half-orcs raised among ores and willing to live out their lives among them are usually evil."
        },
        "description": "Whether united under the leadership of a mighty warlock or having fought to a standstill after years of conflict, orc and human tribes sometimes form alliances, joining forces into a larger horde to the terror of civilized lands nearby. When these alliances are sealed by marriages, half-orcs are born. S om e half-orcs rise to become proud chiefs of orc tribes, their human blood giving them an edge over their full-blooded orc rivals. Some venture into the world to prove their worth among humans and other m ore civilized races. Many of these become adventurers, achieving greatness for their mighty deeds and notoriety for their barbaric custom s and savage fury.",
        "languages": [
            "Common",
            "Orc"
        ],
        "modifiers": [
            {
                "description": "Thanks to your orc blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.",
                "modifier": "Darkvision"
            },
            {
                "description": "You gain proficiency in the Intimidation skill.",
                "modifier": "Menacing"
            },
            {
                "description": "When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can't use this feature again until you finish a long rest.",
                "modifier": "Relentless Endurance"
            },
            {
                "description": "When you score a critical hit with a melee weapon attack, you can roll one of the weapon's damage dice one additional time and add it to the extra damage of the critical hit.",
                "modifier": "Savage Attacks"
            }
        ],
        "names": {
            "child": [],
            "clan": [],
            "description": "Half-orcs usually have names appropriate to the culture in which they were raised. A half-orc who wants to fit in among humans might trade an orc name for a human name. Some half-orcs with human names decide to adopt a guttural orc name because they think it makes them more intimidating.",
            "family": [],
            "female": [
                "Baggi",
                "Emen",
                "Engong",
                "Kansif",
                "Myev",
                "Neega",
                "Ovak",
                "Ownka",
                "Shautha",
                "Sutha",
                "Vola",
                "Volen",
                "Yevelda"
            ],
            "male": [
                "Dench",
                "Feng",
                "Gell",
                "Henk",
                "Holg",
                "Imsh",
                "Keth",
                "Krusk",
                "Mhurren",
                "Ront",
                "Shump",
                "Thokk"
            ],
            "nickname": [],
            "order": [
                "first"
            ],
            "surname": [],
            "virtue": []
        },
        "race": "Half-Orc",
        "size": {
            "class": "Medium",
            "description": "Half-orcs are somewhat larger and bulkier than humans, and they range from 5 to well over 6 feet tall.  Your size is Medium.",
            "lower": 5.0,
            "upper": 6.0
        },
        "speed": {
            "description": "Your base walking speed is 30 feet.",
            "speed": 30
        },
        "subraces": []
    },
    {
        "ability_score_increase": {
            "abilities": {
                "charisma": 2,
                "constitution": 0,
                "dexterity": 0,
                "intellect": 1,
                "strength": 0,
                "wisdom": 0
            },
            "description": "Your Intelligence score increases by 1, and your Charisma score increases by 2."
        },
        "age": {
            "adulthood": 18,
            "description": "Tieflings mature at the same rate as humans but live a few years longer.",
            "lifespan": 100
        },
        "alignment": {
            "alignment": "CE",
            "description": "Tieflings might not have an innate tendency toward evil, but many of them end up there.  Evil or not, an independent nature inclines many tieflings toward a chaotic alignment."
        },
        "description": "To be greeted with stares and whispers, to suffer violence and insult on the street, to see mistrust and fear in every eye: this is the lot of the tiefling. And to twist the knife, tieflings know that this is because a pact struck generations ago infused the essence of Asmodeus-overlord of the Nine Hells-into their bloodline. Their appearance and their nature are not their fault but the result of an ancient sin, for which they and their children and their children's children will always be held accountable.",
        "languages": [
            "Common",
            "Infernal"
        ],
        "modifiers": [
            {
                "description": "Thanks to your infernal heritage, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades o f gray.",
                "modifier": "Darkvision"
            },
            {
                "description": "You have resistance to fire damage.",
                "modifier": "Hellish Resistance"
            },
            {
                "description": "You know the thaumaturgy cantrip.  Once you reach 3rd level, you can cast the hellish rebuke spell once per day as a 2nd-level spell. Once you reach 5th level, you can also cast the darkness spell once per day. Charisma is your spellcasting ability for these spells.",
                "modifier": "Infernal Legacy"
            }
        ],
        "names": {
            "child": [],
            "clan": [],
            "description": "Tiefling names fall into three broad categories. Tieflings born into another culture typically have names reflective of that culture. Some have names derived from the Infernal language, passed down through generations, that reflect their fiendish heritage. And some younger tieflings, striving to find a place in the world, adopt a name that signifies a virtue or other concept and then try to em body that concept. For some, the chosen name is a noble quest. For others, it's a grim destiny.",
            "family": [],
            "female": [
                "Akta",
                "Anakis",
                "Bryseis",
                "Criella",
                "Damaia",
                "Ea",
                "Kallista",
                "Lerissa",
                "Makaria",
                "Nemeia",
                "Orianna",
                "Phelaia",
                "Rieta"
            ],
            "male": [
                "Akmenos",
                "Amnon",
                "Barakas",
                "Damakos",
                "Ekemon",
                "Iados",
                "Kairon",
                "Leucis",
                "Melech",
                "Mordai",
                "Morthos",
                "Pelaios",
                "Skamos",
                "Therai"
            ],
            "nickname": [],
            "order": [
                "first",
                "virtue"
            ],
            "surname": [],
            "virtue": [
                "Art",
                "Carrion",
                "Chant",
                "Creed",
                "Despair",
                "Excellence",
                "Fear",
                "Glory",
                "Hope",
                "Ideal",
                "Music",
                "Nowhere",
                "Open",
                "Poetry",
                "Quest",
                "Random",
                "Reverence",
                "Sorrow",
                "Temerity",
                "Torment",
                "Weary"
            ]
        },
        "race": "Tiefling",
        "size": {
            "class": "Medium",
            "description": "Tieflings are about the same size and build as humans. Your size is Medium.",
            "lower": 4.0,
            "upper": 7.0
        },
        "speed": {
            "description": "Your base walking speed is 30 feet.",
            "speed": 25
        },
        "subraces": []
    }
]
